import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class AyaService {
  oneAya:any;
  aya = [
    {
      id:1,
      tabou: "الشرك بالله",
      soura: [
        {
          idSoura:1,
          titre: 'الأنعام 151',
          texte: 'قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ ',
          texte1:'أَلَّا تُشْرِكُوا بِهِ شَيْئًا ۖ ',
          texte2:'وَبِالْوَالِدَيْنِ إِحْسَانًا ۖ وَلَا تَقْتُلُوا أَوْلَادَكُم مِّنْ إِمْلَاقٍ ۖ نَّحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ ۖ وَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ۖ وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ذَٰلِكُمْ وَصَّاكُم بِهِ لَعَلَّكُمْ تَعْقِلُونَ',
          texte3: `عدم الشرك بالله$

{قُلْ تَعَالَوْاْ أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ} لتقفوا مع هذه المحرّمات حيث يريد الله منكم أن تقفوا، دون أن تتجاوزوا حدوده عن جهلٍ وسفاهة، وذلك من أجل خلق المجتمع المؤمن المسؤول المتكامل في أفكاره وعلاقاته.

{أَلاَّ تُشْرِكُواْ بِهِ شَيْئاً} فالإشراك هو في مقدمة المحرّمات، لأنه يمثل المنهج الذي يضع الإنسان في متاهات الأهواء والمطامع والشهوات، وفي ظلمات التيارات والاتجاهات والأصنام، وفي أجواء الأشخاص الذين تختلف أذواقهم ومسيرتهم وأفكارهم، فلا يعرف الإنسان ماذا يأخذ وماذا يدع، فكل واحدةٍ من هؤلاء تدعوه إلى أن يسير معها ويتجاوب مع حاجاتها ومنطلقاتها، فيفقد الإنسان ـ معها ـ كل طمأنينةٍ، وكل هدوءٍ وتركيز، ويحس أنه ينتقل من تيهٍ إلى آخر، ومن ظلمةٍ إلى ظلمة.

إنّ الشرك منهجٌ متكاملٌ، يحدّد للإنسان طريقته في التفكير، وفي السلوك، وفي أسلوب الحياة، وممارسته للمسؤوليّة، وتصوره للكون وللحياة، ولله وللناس، وهو منهج لا يدعو إلى الاستقرار بل يبعث على القلق. ولذلك أراد الله للناس أن يبتعدوا عنه، لأنه يمثل الخط الذي يبعدهم عن الحقيقة، ويساهم في تعقيد حياتهم، وتضييعها وتمييعها في أكثر من لونٍ وأكثر من صعيد.

أمّا التوحيد، فيمثل وحدة الله والحقيقة والهدف، وجميع الوسائل التي تربط الإنسان بالهدف، إنه منهج الاستقامة الذي يربط بين البداية والنهاية في اتجاهٍ واحدٍ، ليس هناك إلا وحيٌ واحدٌ، يستمدُّ الإنسان منه منهج التفكير، وليس هناك إلا إله واحدٌ يتجه إليه في العبادة وفي الطاعة، ويستعين به في كل شيء، وبذلك يعرف الإنسان نفسه وربّه، ويعرف من خلال ذلك كيف يواجه مسؤوليته في الحياة وكيف يحدد دوره في حركة الأمّة الواحدة في بناء الكون على هدى الله ووحيه. وبذلك كان الشرك ظلماً لله وللناس وللحياة، وكان جريمة لا يغفرها الله، لأنها فوق الجرائم كلها في الخطورة.`
          
        }
      ]
    },
    {
      id:2,
      tabou: "عقوق الوالدين",
      soura: [
        {
          idSoura:1,
          titre: 'الأنعام 151',
          texte: 'قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا بِهِ شَيْئًا ۖ ',
          texte1: 'وَبِالْوَالِدَيْنِ إِحْسَانًا ۖ',
          texte2: ' وَلَا تَقْتُلُوا أَوْلَادَكُم مِّنْ إِمْلَاقٍ ۖ نَّحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ ۖ وَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ۖ وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ذَٰلِكُمْ وَصَّاكُم بِهِ لَعَلَّكُمْ تَعْقِلُونَ',
          texte3: `عدم الشرك بالله$

{قُلْ تَعَالَوْاْ أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ} لتقفوا مع هذه المحرّمات حيث يريد الله منكم أن تقفوا، دون أن تتجاوزوا حدوده عن جهلٍ وسفاهة، وذلك من أجل خلق المجتمع المؤمن المسؤول المتكامل في أفكاره وعلاقاته.

{أَلاَّ تُشْرِكُواْ بِهِ شَيْئاً} فالإشراك هو في مقدمة المحرّمات، لأنه يمثل المنهج الذي يضع الإنسان في متاهات الأهواء والمطامع والشهوات، وفي ظلمات التيارات والاتجاهات والأصنام، وفي أجواء الأشخاص الذين تختلف أذواقهم ومسيرتهم وأفكارهم، فلا يعرف الإنسان ماذا يأخذ وماذا يدع، فكل واحدةٍ من هؤلاء تدعوه إلى أن يسير معها ويتجاوب مع حاجاتها ومنطلقاتها، فيفقد الإنسان ـ معها ـ كل طمأنينةٍ، وكل هدوءٍ وتركيز، ويحس أنه ينتقل من تيهٍ إلى آخر، ومن ظلمةٍ إلى ظلمة.

إنّ الشرك منهجٌ متكاملٌ، يحدّد للإنسان طريقته في التفكير، وفي السلوك، وفي أسلوب الحياة، وممارسته للمسؤوليّة، وتصوره للكون وللحياة، ولله وللناس، وهو منهج لا يدعو إلى الاستقرار بل يبعث على القلق. ولذلك أراد الله للناس أن يبتعدوا عنه، لأنه يمثل الخط الذي يبعدهم عن الحقيقة، ويساهم في تعقيد حياتهم، وتضييعها وتمييعها في أكثر من لونٍ وأكثر من صعيد.

أمّا التوحيد، فيمثل وحدة الله والحقيقة والهدف، وجميع الوسائل التي تربط الإنسان بالهدف، إنه منهج الاستقامة الذي يربط بين البداية والنهاية في اتجاهٍ واحدٍ، ليس هناك إلا وحيٌ واحدٌ، يستمدُّ الإنسان منه منهج التفكير، وليس هناك إلا إله واحدٌ يتجه إليه في العبادة وفي الطاعة، ويستعين به في كل شيء، وبذلك يعرف الإنسان نفسه وربّه، ويعرف من خلال ذلك كيف يواجه مسؤوليته في الحياة وكيف يحدد دوره في حركة الأمّة الواحدة في بناء الكون على هدى الله ووحيه. وبذلك كان الشرك ظلماً لله وللناس وللحياة، وكان جريمة لا يغفرها الله، لأنها فوق الجرائم كلها في الخطورة.`

        }
      ]
    },
    {
      id:3,
      tabou: "قتل الأولاد من إملاق",
      soura: [
        {
          idSoura:1,
          titre: 'الأنعام 151',
          texte: 'قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا ۖ',
          texte1: ' وَلَا تَقْتُلُوا أَوْلَادَكُم مِّنْ إِمْلَاقٍ ۖ نَّحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ ۖ ',
          texte2: 'وَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ۖ وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ذَٰلِكُمْ وَصَّاكُم بِهِ لَعَلَّكُمْ تَعْقِلُونَ',
          texte3: `عدم الشرك بالله$

{قُلْ تَعَالَوْاْ أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ} لتقفوا مع هذه المحرّمات حيث يريد الله منكم أن تقفوا، دون أن تتجاوزوا حدوده عن جهلٍ وسفاهة، وذلك من أجل خلق المجتمع المؤمن المسؤول المتكامل في أفكاره وعلاقاته.

{أَلاَّ تُشْرِكُواْ بِهِ شَيْئاً} فالإشراك هو في مقدمة المحرّمات، لأنه يمثل المنهج الذي يضع الإنسان في متاهات الأهواء والمطامع والشهوات، وفي ظلمات التيارات والاتجاهات والأصنام، وفي أجواء الأشخاص الذين تختلف أذواقهم ومسيرتهم وأفكارهم، فلا يعرف الإنسان ماذا يأخذ وماذا يدع، فكل واحدةٍ من هؤلاء تدعوه إلى أن يسير معها ويتجاوب مع حاجاتها ومنطلقاتها، فيفقد الإنسان ـ معها ـ كل طمأنينةٍ، وكل هدوءٍ وتركيز، ويحس أنه ينتقل من تيهٍ إلى آخر، ومن ظلمةٍ إلى ظلمة.

إنّ الشرك منهجٌ متكاملٌ، يحدّد للإنسان طريقته في التفكير، وفي السلوك، وفي أسلوب الحياة، وممارسته للمسؤوليّة، وتصوره للكون وللحياة، ولله وللناس، وهو منهج لا يدعو إلى الاستقرار بل يبعث على القلق. ولذلك أراد الله للناس أن يبتعدوا عنه، لأنه يمثل الخط الذي يبعدهم عن الحقيقة، ويساهم في تعقيد حياتهم، وتضييعها وتمييعها في أكثر من لونٍ وأكثر من صعيد.

أمّا التوحيد، فيمثل وحدة الله والحقيقة والهدف، وجميع الوسائل التي تربط الإنسان بالهدف، إنه منهج الاستقامة الذي يربط بين البداية والنهاية في اتجاهٍ واحدٍ، ليس هناك إلا وحيٌ واحدٌ، يستمدُّ الإنسان منه منهج التفكير، وليس هناك إلا إله واحدٌ يتجه إليه في العبادة وفي الطاعة، ويستعين به في كل شيء، وبذلك يعرف الإنسان نفسه وربّه، ويعرف من خلال ذلك كيف يواجه مسؤوليته في الحياة وكيف يحدد دوره في حركة الأمّة الواحدة في بناء الكون على هدى الله ووحيه. وبذلك كان الشرك ظلماً لله وللناس وللحياة، وكان جريمة لا يغفرها الله، لأنها فوق الجرائم كلها في الخطورة.`

        
        },
        {
          idSoura:2,
          titre: 'الإسراء 31',
          texte1: 'وَلَا تَقْتُلُوا أَوْلَادَكُمْ خَشْيَةَ إِمْلَاقٍ ۖ نَحْنُ نَرْزُقُهُمْ وَإِيَّاكُمْ ۚ إِنَّ قَتْلَهُمْ كَانَ خِطْئًا كَبِيرًا',
          texte3: `عدم الشرك بالله$

{قُلْ تَعَالَوْاْ أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ} لتقفوا مع هذه المحرّمات حيث يريد الله منكم أن تقفوا، دون أن تتجاوزوا حدوده عن جهلٍ وسفاهة، وذلك من أجل خلق المجتمع المؤمن المسؤول المتكامل في أفكاره وعلاقاته.

{أَلاَّ تُشْرِكُواْ بِهِ شَيْئاً} فالإشراك هو في مقدمة المحرّمات، لأنه يمثل المنهج الذي يضع الإنسان في متاهات الأهواء والمطامع والشهوات، وفي ظلمات التيارات والاتجاهات والأصنام، وفي أجواء الأشخاص الذين تختلف أذواقهم ومسيرتهم وأفكارهم، فلا يعرف الإنسان ماذا يأخذ وماذا يدع، فكل واحدةٍ من هؤلاء تدعوه إلى أن يسير معها ويتجاوب مع حاجاتها ومنطلقاتها، فيفقد الإنسان ـ معها ـ كل طمأنينةٍ، وكل هدوءٍ وتركيز، ويحس أنه ينتقل من تيهٍ إلى آخر، ومن ظلمةٍ إلى ظلمة.

إنّ الشرك منهجٌ متكاملٌ، يحدّد للإنسان طريقته في التفكير، وفي السلوك، وفي أسلوب الحياة، وممارسته للمسؤوليّة، وتصوره للكون وللحياة، ولله وللناس، وهو منهج لا يدعو إلى الاستقرار بل يبعث على القلق. ولذلك أراد الله للناس أن يبتعدوا عنه، لأنه يمثل الخط الذي يبعدهم عن الحقيقة، ويساهم في تعقيد حياتهم، وتضييعها وتمييعها في أكثر من لونٍ وأكثر من صعيد.

أمّا التوحيد، فيمثل وحدة الله والحقيقة والهدف، وجميع الوسائل التي تربط الإنسان بالهدف، إنه منهج الاستقامة الذي يربط بين البداية والنهاية في اتجاهٍ واحدٍ، ليس هناك إلا وحيٌ واحدٌ، يستمدُّ الإنسان منه منهج التفكير، وليس هناك إلا إله واحدٌ يتجه إليه في العبادة وفي الطاعة، ويستعين به في كل شيء، وبذلك يعرف الإنسان نفسه وربّه، ويعرف من خلال ذلك كيف يواجه مسؤوليته في الحياة وكيف يحدد دوره في حركة الأمّة الواحدة في بناء الكون على هدى الله ووحيه. وبذلك كان الشرك ظلماً لله وللناس وللحياة، وكان جريمة لا يغفرها الله، لأنها فوق الجرائم كلها في الخطورة.`

        
        }
      ]
    },
    {
      id:4,
      tabou: "الربا",
      soura: [
        {
          idSoura:1,
          titre: 'البقرة 275',
          texte: 'الَّذِينَ يَأْكُلُونَ الرِّبَا لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنَ الْمَسِّ ۚ ذَٰلِكَ بِأَنَّهُمْ قَالُوا إِنَّمَا الْبَيْعُ مِثْلُ الرِّبَا ۗ ',
          texte1: 'وَأَحَلَّ اللَّهُ الْبَيْعَ وَحَرَّمَ الرِّبَا ۚ',
          texte2: 'فَمَنْ جَاءَهُ مَوْعِظَةٌ مِنْ رَبِّهِ فَانْتَهَىٰ فَلَهُ مَا سَلَفَ وَأَمْرُهُ إِلَى اللَّهِ ۖ وَمَنْ عَادَ فَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ',
          texte3: ''
        }
      ]
    },
    {
      id:5,
      tabou: "اقتراب الفواحش",
      soura: [
        {
          idSoura:1,
          titre: 'الأنعام 151',
          texte: 'قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا ۖ وَلَا تَقْتُلُوا أَوْلَادَكُم مِّنْ إِمْلَاقٍ ۖ نَّحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ ۖ ',
          texte1: 'وَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ۖ ',
          texte2: 'وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ذَٰلِكُمْ وَصَّاكُم بِهِ لَعَلَّكُمْ تَعْقِلُونَ',
          texte3: ''
        }
      ]
    },
    {
      id:6,
      tabou: "قتل النفس",
      soura: [
        {
          idSoura:1,
          titre: 'الأنعام 151',
          texte: 'قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا ۖ وَلَا تَقْتُلُوا أَوْلَادَكُم مِّنْ إِمْلَاقٍ ۖ نَّحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ ۖ وَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ۖ ',
          texte1: 'وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ',
          texte2: 'ذَٰلِكُمْ وَصَّاكُم بِهِ لَعَلَّكُمْ تَعْقِلُونَ',
          texte3: ''
        }
      ]
    },
    {
      id:7,
      tabou: "أكل مال اليتيم",
      soura: [
        {
          idSoura:1,
          titre: 'الأنعام 152',
          texte: '',
          texte1: 'وَلَا تَقْرَبُوا مَالَ الْيَتِيمِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ حَتَّىٰ يَبْلُغَ أَشُدَّهُ ۖ ',
          texte2: 'وَأَوْفُوا الْكَيْلَ وَالْمِيزَانَ بِالْقِسْطِ ۖ لَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا ۖ وَإِذَا قُلْتُمْ فَاعْدِلُوا وَلَوْ كَانَ ذَا قُرْبَىٰ ۖ وَبِعَهْدِ اللَّهِ أَوْفُوا ۚ ذَٰلِكُمْ وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَذَكَّرُونَ',
          texte3: ''
        }
      ]
    },
    {
      id:8,
      tabou: "المحرمات من النساء",
      soura: [
        {
          idSoura:1,
          titre: 'النساء 23',
          texte: '',
          texte1: 'حُرِّمَتْ عَلَيْكُمْ أُمَّهَاتُكُمْ وَبَنَاتُكُمْ وَأَخَوَاتُكُمْ وَعَمَّاتُكُمْ وَخَالَاتُكُمْ وَبَنَاتُ الْأَخِ وَبَنَاتُ الْأُخْتِ وَأُمَّهَاتُكُمُ اللَّاتِي أَرْضَعْنَكُمْ وَأَخَوَاتُكُمْ مِنَ الرَّضَاعَةِ وَأُمَّهَاتُ نِسَائِكُمْ وَرَبَائِبُكُمُ اللَّاتِي فِي حُجُورِكُمْ مِنْ نِسَائِكُمُ اللَّاتِي دَخَلْتُمْ بِهِنَّ فَإِنْ لَمْ تَكُونُوا دَخَلْتُمْ بِهِنَّ فَلَا جُنَاحَ عَلَيْكُمْ وَحَلَائِلُ أَبْنَائِكُمُ الَّذِينَ مِنْ أَصْلَابِكُمْ وَأَنْ تَجْمَعُوا بَيْنَ الْأُخْتَيْنِ إِلَّا مَا قَدْ سَلَفَ ۗ',
          texte2: 'إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا',
          texte3: ''
        }
      ]
    },
    {
      id:9,
      tabou: "المحرمات من الأطعمة",
      soura: [
        {
          idSoura:1,
          titre: 'المائدة 3',
          texte: '',
          texte1: 'حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ وَالْمُنْخَنِقَةُ وَالْمَوْقُوذَةُ وَالْمُتَرَدِّيَةُ وَالنَّطِيحَةُ وَمَا أَكَلَ السَّبُعُ إِلَّا مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى النُّصُبِ وَأَنْ تَسْتَقْسِمُوا بِالْأَزْلَامِ ۚ ',
          texte2: 'ذَٰلِكُمْ فِسْقٌ ۗ الْيَوْمَ يَئِسَ الَّذِينَ كَفَرُوا مِنْ دِينِكُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ ۚ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا ۚ فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِإِثْمٍ ۙ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ',
          texte3: ''
        }
      ]
    },
    {
      id: 9,
      tabou: "المحرمات من الأطعمة",
      soura: [
        {
          idSoura: 1,
          titre: 'المائدة 3',
          texte: '',
          texte1: 'حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ وَالْمُنْخَنِقَةُ وَالْمَوْقُوذَةُ وَالْمُتَرَدِّيَةُ وَالنَّطِيحَةُ وَمَا أَكَلَ السَّبُعُ إِلَّا مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى النُّصُبِ وَأَنْ تَسْتَقْسِمُوا بِالْأَزْلَامِ ۚ ',
          texte2: 'ذَٰلِكُمْ فِسْقٌ ۗ الْيَوْمَ يَئِسَ الَّذِينَ كَفَرُوا مِنْ دِينِكُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ ۚ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا ۚ فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِإِثْمٍ ۙ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ',
          texte3: ''
        }
      ]
    },
    {
      id: 9,
      tabou: "المحرمات من الأطعمة",
      soura: [
        {
          idSoura: 1,
          titre: 'المائدة 3',
          texte: '',
          texte1: 'حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنْزِيرِ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ وَالْمُنْخَنِقَةُ وَالْمَوْقُوذَةُ وَالْمُتَرَدِّيَةُ وَالنَّطِيحَةُ وَمَا أَكَلَ السَّبُعُ إِلَّا مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى النُّصُبِ وَأَنْ تَسْتَقْسِمُوا بِالْأَزْلَامِ ۚ ',
          texte2: 'ذَٰلِكُمْ فِسْقٌ ۗ الْيَوْمَ يَئِسَ الَّذِينَ كَفَرُوا مِنْ دِينِكُمْ فَلَا تَخْشَوْهُمْ وَاخْشَوْنِ ۚ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا ۚ فَمَنِ اضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لِإِثْمٍ ۙ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ',
          texte3: ''
        }
      ]
    },
   

  ]

  
  constructor() { }

 
  getAyaById(id:number){
    const oneAya=this.aya.find((object)=>{
      return object.id === id
    });
    return oneAya;
  }

  getSouraById(id: number, idSoura:number) {
    const soura = this.getAyaById(id).soura.find((object)=>{
      return object.idSoura===idSoura
    })

    return soura;
  }
    
  

}
